package main

import "fmt"

func main() {
	a1 := make([]int, 0, 10)                 // [_,_,_,_,_,_,_,_,_,_] (len:0, cap:10)
	a1 = append(a1, []int{1, 2, 3, 4, 5}...) // [1,2,3,4,5,_,_,_,_,_] (len:5, cap:10]
	a2 := append(a1, 6)                      // [1,2,3,4,5,6,_,_,_,_] (в а1 остается len:5, а вот в а2 уже len:6, cap:10)
	a3 := append(a1, 7)                      //[1,2,3,4,5,7,_,_,_,_] (len:6, cap:10, перезатерли значение "6" на "7")
	fmt.Println(a1, a2, a3)                  // [1 2 3 4 5] [1 2 3 4 5 7] [1 2 3 4 5 7] - (из за того что в а3 перезатерли значение на "7", в следствии этого у а2 тоже значение "7")
}
